Tekla Open API Reference for Tekla Structures 2025
MeshItem.DistanceCross Property
 The mesh item's cross direction distance.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string DistanceCross { get; set; }
Public Property DistanceCross As String
	Get
	Set
Property Value
Type: String
See Also
Reference
MeshItem Class
Tekla.Structures.Catalogs Namespace